{
  "sn2.23:0.3": "Serī",
  "sn2.23:1.1": "Standing to one side, the young deva Serī addressed the Blessed One in verse: ",
  "sn2.23:2.1": "“They always take delight in food,",
  "sn2.23:2.2": "Both devas and human beings.",
  "sn2.23:2.3": "So what sort of spirit could it be",
  "sn2.23:2.4": "That does not take delight in food?”",
  "sn2.23:3.1": "“When they give out of faith",
  "sn2.23:3.2": "With a heart of confidence,",
  "sn2.23:3.3": "Food accrues to [the giver] himself",
  "sn2.23:3.4": "Both in this world and the next.",
  "sn2.23:4.1": "“Therefore, having removed stinginess,",
  "sn2.23:4.2": "The conqueror of the stain should give a gift.",
  "sn2.23:4.3": "Merits, in the other world,",
  "sn2.23:4.4": "are the support for living beings.” ",
  "sn2.23:5.1": "“It is wonderful, venerable sir! It is amazing,",
  "sn2.23:5.2": "venerable sir! How well this was stated by the Blessed One:",
  "sn2.23:6.1": "“‘When they give out of faith…",
  "sn2.23:7.3": "Merits, in the other world,",
  "sn2.23:7.4": "are the support for living beings.’",
  "sn2.23:8.1": "’“Once in the past, venerable sir, I was a king named Serī, a donor, a philanthropist, one who spoke in praise of giving. ",
  "sn2.23:8.2": "At the four gates I had gifts given to ascetics, brahmins, paupers, wayfarers, mendicants, and beggars.",
  "sn2.23:8.3": "Then, venerable sir, the harem women came to me and said:",
  "sn2.23:8.4": "‘Your majesty gives gifts, but we do not give gifts.",
  "sn2.23:8.5": "It would be good if, with your majesty’s assistance, we too might give gifts and do meritorious deeds.",
  "sn2.23:8.6": "’ It occurred to me:",
  "sn2.23:8.7": " ‘I am a donor, a philanthropist, one who speaks in praise of giving.",
  "sn2.23:8.8": "So when they say,“Let us give gifts”, what am I to say to them?’",
  "sn2.23:8.9": "So, venerable sir, I gave the first gate to the harem women. ",
  "sn2.23:8.10": "There the harem women gave gifts, and my gifts returned to me.",
  "sn2.23:9.1": "“Then, venerable sir, my khattiya vassals came to me and said:",
  "sn2.23:9.2": "‘Your majesty gives gifts, the harem women give gifts, but we do not give gifts.",
  "sn2.23:9.3": "It would be good if, with your majesty’s assistance, we too might give gifts and do meritorious deeds.",
  "sn2.23:9.4": "’ It occurred to me:",
  "sn2.23:9.5": " ‘I am a donor…",
  "sn2.23:9.7": "’ So, venerable sir, I gave the second gate to the khattiya vassals.",
  "sn2.23:9.8": "There the khattiya vassals gave gifts, and my gifts returned to me.",
  "sn2.23:10.1": "“Then, venerable sir, my troops came to me …",
  "sn2.23:10.7": "So, venerable sir, I gave the third gate to the troops.",
  "sn2.23:10.8": "There the troops gave gifts, and my gifts returned to me.",
  "sn2.23:11.1": "“Then, venerable sir, the brahmins and householders came to me …",
  "sn2.23:11.7": "So, venerable sir, I gave the fourth gate to the brahmins and householders. ",
  "sn2.23:11.8": "There the brahmins and householders gave gifts, and my gifts returned to me.",
  "sn2.23:12.1": "“Then, venerable sir, my men came to me and said:",
  "sn2.23:12.2": "‘Now your majesty is not giving gifts anywhere.",
  "sn2.23:12.3": "’ When this was said, I told those men:",
  "sn2.23:12.4": "‘Well then, I say, send half of the revenue generated in the outlying provinces from there to the palace. There itself give half as gifts to ascetics, brahmins, paupers, wayfarers, mendicants, and beggars. ",
  "sn2.23:12.5": "’“I did not reach any limit, venerable sir, to the meritorious deeds that I did for such a long time,",
  "sn2.23:12.6": "‘There is just so much merit, ’ or ‘There is just so much result of merit, ’ or ‘For just so long am I to dwell in heaven. ",
  "sn2.23:12.7": "’ It is wonderful, venerable sir! It is amazing, venerable sir! ",
  "sn2.23:12.8": "How well this was stated by the Blessed One:",
  "sn2.23:13.1": "“‘When they give out of faith",
  "sn2.23:13.2": "With a heart of confidence,",
  "sn2.23:13.3": "Food accrues to [the giver] himself",
  "sn2.23:13.4": "Both in this world and the next.",
  "sn2.23:14.1": "“‘Therefore, having removed stinginess,",
  "sn2.23:14.2": "The conqueror of the stain should give a gift.",
  "sn2.23:14.3": "Deeds of merit, in the other world",
  "sn2.23:14.4": "are the support for living beings ’” "
}