{
  "sn7.18:0.3": "The Wood Gatherers",
  "sn7.18:1.1": "On one occasion the Blessed One was dwelling among the Kosalans in a certain woodland thicket.",
  "sn7.18:1.2": "Now on that occasion a number of brahmin boys, students of a certain brahmin of the Bhāradvāja clan, approached that woodland thicket while collecting firewood. Having approached, they saw the Blessed One sitting in that woodland thicket with his legs folded crosswise, holding his body erect, having set up mindfulness in front of him. Having seen him, they approached the brahmin of the Bhāradvāja clan and said to him:",
  "sn7.18:1.3": "“See now, master,",
  "sn7.18:1.4": "you should know that in such and such a woodland thicket an ascetic is sitting with his legs folded crosswise,",
  "sn7.18:1.5": "Then the brahmin of the Bhāradvāja clan, together with those brahmin boys, went to that woodland thicket.",
  "sn7.18:1.6": "He saw the Blessed One sitting there … having set up mindfulness in front of him.",
  "sn7.18:1.7": "He then approached the Blessed One and addressed him in verse:",
  "sn7.18:2.1": "Deep in the woods where many terrors lurk,",
  "sn7.18:2.2": "Having entered the empty, desolate forest,",
  "sn7.18:2.3": "With a motionless body, steady, lovely,",
  "sn7.18:2.4": "How you meditate, bhikkhu, so beautifully!",
  "sn7.18:3.1": "In the forest where no song or music sounds,",
  "sn7.18:3.2": "A solitary sage has resorted to the woods!",
  "sn7.18:3.3": "This strikes me as a wonder—that you dwell",
  "sn7.18:3.4": "With joyful mind alone in the woods.",
  "sn7.18:4.1": "The company of the world’s divine lord,",
  "sn7.18:4.2": "I suppose you desire the supreme triple heaven,",
  "sn7.18:4.3": "Therefore you resort to the desolate forest:",
  "sn7.18:4.4": "You practise penance here for attaining Brahmā.",
  "sn7.18:5.1": "Whatever be the many desires and delights",
  "sn7.18:5.2": "That are always attached to the manifold elements,",
  "sn7.18:5.3": "The longings sprung from the root of unknowing:",
  "sn7.18:5.4": "All I have demolished along with their root.",
  "sn7.18:6.1": "I am desireless, unattached, disengaged;",
  "sn7.18:6.2": "My vision of all things has been purified.",
  "sn7.18:6.3": "Having attained the auspicious—supreme enlightenment—",
  "sn7.18:6.4": "Self-confident, brahmin, I meditate alone.",
  "sn7.18:7.1": "When this was said, the brahmin of the Bhāradvāja clan said to the Blessed One:",
  "sn7.18:7.2": "Magnificent, Master Gotama! Magnificent,",
  "sn7.18:7.3": "Let Master Gotama remember me as a lay follower who from today has gone for refuge for life."
}
