{
  "sn7.2:0.3": "Abuse",
  "sn7.2:1.1": "On one occasion the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrel Sanctuary.",
  "sn7.2:1.2": "The brahmin Akkosaka Bhāradvāja, Bhāradvāja the Abusive, heard:",
  "sn7.2:2.1": "“It is said that the brahmin of the Bhāradvāja clan has gone forth from the household life into homelessness under the ascetic Gotama. ” Angry and displeased, he approached the Blessed One and  abused and reviled him with rude, harsh words. ",
  "sn7.2:2.2": "When he had finished speaking, the Blessed One said to him: “What do you think, brahmin?",
  "sn7.2:2.3": "Do your friends and colleagues, kinsmen and relatives, as well as guests come to visit you?”",
  "sn7.2:2.4": "“Sometimes they come to visit, Master Gotama. ”",
  "sn7.2:2.5": "“Do you then offer them some food or a meal or a snack?”",
  "sn7.2:2.6": "“Sometimes I do, Master Gotama. ”",
  "sn7.2:2.7": "“But if they do not accept it from you, then to whom does the food belong?”",
  "sn7.2:2.8": "“If they do not accept it from me, then the food still belongs to us. ” ",
  "sn7.2:2.9": "“So too, brahmin, we—who do not abuse anyone, who do not scold anyone, who do not rail against anyone—refuse to accept from you the abuse and scolding and tirade you let loose at us. ",
  "sn7.2:2.10": "It still belongs to you, brahmin!",
  "sn7.2:2.11": "It still belongs to you, brahmin!",
  "sn7.2:3.1": "“Brahmin, one who abuses his own abuser, who scolds the one who scolds him, who rails against the one who rails at him—he is said to partake of the meal, to enter upon an exchange. ",
  "sn7.2:3.2": "But we do not partake of your meal; we do not enter upon an exchange.",
  "sn7.2:3.3": "It still belongs to you, brahmin!",
  "sn7.2:3.4": "It still belongs to you, brahmin!”",
  "sn7.2:3.5": "“The king and his retinue understand the ascetic  yet Master Gotama still gets angry.",
  "sn7.2:3.6": "Gotama to be an arahant,”",
  "sn7.2:4.1": "[The Blessed One: ]  “How can anger arise in one who is angerless,",
  "sn7.2:4.2": "In the tamed one of righteous living,",
  "sn7.2:4.3": "In one liberated by perfect knowledge,",
  "sn7.2:4.4": "In the Stable One who abides in peace?",
  "sn7.2:5.1": "Thereby makes things worse for himself.",
  "sn7.2:5.2": "“One who repays an angry man with anger",
  "sn7.2:5.3": "Not repaying an angry man with anger,",
  "sn7.2:5.4": "One wins a battle hard to win.",
  "sn7.2:6.1": "“He practises for the welfare of both:",
  "sn7.2:6.2": "His own and the other’s.",
  "sn7.2:6.3": "When, knowing that his foe is angry,",
  "sn7.2:6.4": "He mindfully maintains his peace.",
  "sn7.2:7.1": "“When he achieves the cure of both:",
  "sn7.2:7.2": "His own and the other’s.",
  "sn7.2:7.3": "The people who consider him a fool",
  "sn7.2:7.4": "Are unskilled in the Dhamma. ”",
  "sn7.2:8.1": "When this was said, the brahmin Akkosaka Bhāradvāja said to the Blessed One:",
  "sn7.2:8.2": " “Magnificent, Master Gotama!…",
  "sn7.2:8.3": "I go for refuge to Master Gotama, and to the Dhamma, and to the Bhikkhu Saṅgha.",
  "sn7.2:8.4": "May I receive the going forth under Master Gotama, may I receive the higher ordination?”",
  "sn7.2:9.1": "Then the brahmin of the Bhāradvāja clan received the going forth under the Blessed One, he received the higher ordination.",
  "sn7.2:9.2": "And soon, not long after his higher ordination, dwelling alone …  ",
  "sn7.2:9.4": "the Venerable Bhāradvāja became one of the arahants."
}