
{
  "sn7.12:0.3": "Udayasutta",
  "sn7.12:1.1": "At Sāvatthī.",
  "sn7.12:1.2": "Then, in the morning, the Blessed One dressed and, taking bowl and robe, approached the residence of the brahmin Udaya.",
  "sn7.12:1.3": "Then the brahmin Udaya filled the Blessed One’s bowl with rice.",
  "sn7.12:1.4": "A second time in the morning the Blessed One dressed and, taking bowl and robe, approached the residence of the brahmin Udaya…",
  "sn7.12:1.5": "A third time in the morning the Blessed One dressed and, taking bowl and robe, approached the residence of the brahmin Udaya.Then a third time the brahmin Udaya filled the Blessed One’s bowl with rice, after which he said to the Blessed One: ",
  "sn7.12:1.6": "“This pesky ascetic Gotama keeps coming again and again.”",
  "sn7.12:2.1": "[The Blessed One: ]  “Again and again, they sow the seed;",
  "sn7.12:2.2": "Again and again, the sky-god sends down rain;",
  "sn7.12:2.3": "Again and again, ploughmen plough the field;",
  "sn7.12:2.4": "Again and again, grain comes to the realm.",
  "sn7.12:3.1": "Again and again, the mendicants beg;",
  "sn7.12:3.2": "Again and again, the donors give;",
  "sn7.12:3.3": "When donors have given again and again,",
  "sn7.12:3.4": "Again and again they go to heaven.",
  "sn7.12:4.1": "Again and again, the dairy folk draw milk;",
  "sn7.12:4.2": "Again and again, the calf goes to its mother;",
  "sn7.12:4.3": "Again and again, one wearies and trembles;",
  "sn7.12:4.4": "Again and again, the dolt enters the womb;",
  "sn7.12:5.1": "Again and again, one is born and dies;",
  "sn7.12:5.2": "Again and again, they take one to the cemetery.",
  "sn7.12:5.3": "But when one has obtained the path That leads to no more renewed existence,",
  "sn7.12:5.4": "Having become broad in wisdom, One is not born again and again!”",
  "sn7.12:6.1": "When this was said, the brahmin Udaya said to the Blessed One :",
  "sn7.12:6.2": "“Magnificent, Master Gotama! Magnificent, Master Gotama!…",
  "sn7.12:6.3": "Let Master Gotama remember me as a lay follower who from today has gone for refuge for life."
}
