{
  "sn7.11:0.3": "Kasi Bhāradvāja",
  "sn7.11:1.1": "Thus have I heard.",
  "sn7.11:1.2": "On one occasion the Blessed One was dwelling among the Magadhans at Dakkhiṇāgiri near the brahmin village of Ekanāḷa.",
  "sn7.11:1.3": "Now on that occasion the brahmin Kasi Bhāradvāja, Bhāradvāja the Ploughman, had five hundred ploughs fastened to their yokes at the time of sowing.",
  "sn7.11:1.4": "Then, in the morning, the Blessed One dressed and, taking bowl and robe, went to the place where the brahmin Kasi Bhāradvāja was at work. ",
  "sn7.11:2.1": "Now on that occasion the brahmin Kasi Bhāradvāja’s food distribution was taking place.",
  "sn7.11:2.2": "Then the Blessed One approached the place of the food distribution  and stood to one side.",
  "sn7.11:2.3": "The brahmin Kasi Bhāradvāja saw the Blessed One standing for alms",
  "sn7.11:2.4": "and said to him:",
  "sn7.11:2.5": " “Recluse, I plough and sow, and when I have ploughed and sown I eat. ",
  "sn7.11:2.6": "You too, ascetic, ought to plough and sow; then, when you have ploughed and sown, you will eat. ” ",
  "sn7.11:2.7": "“I too, brahmin, plough and sow, and when I have ploughed and sown I eat. ” ",
  "sn7.11:2.8": "“But we do not see Master Gotama’s yoke or plough or ploughshare or goad or oxen; yet Master Gotama says, ‘I too, brahmin, plough and sow, and when I have ploughed and sown I eat. ’” ",
  "sn7.11:2.10": "Then the brahmin Kasi Bhāradvāja addressed the Blessed One in verse:",
  "sn7.11:3.1": "“You claim to be a man who works the plough,",
  "sn7.11:3.2": "But I do not see your ploughing.",
  "sn7.11:3.3": "If you’re a ploughman, answer me:",
  "sn7.11:3.4": "How should we understand your ploughing?”",
  "sn7.11:4.1": "[The Blessed One: ]  “Faith is the seed, austerity the rain,",
  "sn7.11:4.2": "Wisdom my yoke and plough;",
  "sn7.11:4.3": "Shame is the pole, mind the yoke-tie,",
  "sn7.11:4.4": "Mindfulness my ploughshare and goad.",
  "sn7.11:5.1": "“Guarded in body, guarded in speech,",
  "sn7.11:5.2": "Controlled in my appetite for food,",
  "sn7.11:5.3": "I use truth as my weeding-hook,",
  "sn7.11:5.4": "And gentleness as my unyoking.",
  "sn7.11:6.1": "“Energy is my beast of burden,",
  "sn7.11:6.2": "Carrying me to security from bondage.",
  "sn7.11:6.3": "It goes ahead without stopping",
  "sn7.11:6.4": "To where, having gone, one does not sorrow .",
  "sn7.11:7.1": "“In such a way this ploughing is done",
  "sn7.11:7.2": "Which has the Deathless as its fruit.",
  "sn7.11:7.3": "Having finished this work of ploughing,",
  "sn7.11:7.4": "One is released from all suffering. ”",
  "sn7.11:8.1": "“Let Master Gotama eat!",
  "sn7.11:8.2": "The worthy is a ploughman,",
  "sn7.11:8.3": "since Master Gotama does ploughing that has even the Deathless as its fruit. ”",
  "sn7.11:9.1": "“Food over which verses have been sung",
  "sn7.11:10.4": "For he is the field for one seeking merit. ”",
  "sn7.11:11.1": "Having said this, the brahmin Kasi Bhāradvāja said to the Blessed One:  ",
  "sn7.11:11.2": "“Magnificent, Master Gotama!",
  "sn7.11:11.3": "remember me as a lay follower who from today has gone for refuge for life. ” "
}