
{
  "sn7.15:1.1": "At Sāvatthī.",
  "sn7.15:1.2": "Now on that occasion a brahmin named Mānatthaddha, Stiff with Conceit, was residing at Sāvatthī.",
  "sn7.15:1.3": "He did not pay homage to his mother or father, nor to his teacher or eldest brother.",
  "sn7.15:1.4": "Now on that occasion the Blessed One was teaching the Dhamma surrounded by a large assembly.",
  "sn7.15:1.5": "Then it occurred to the brahmin Mānatthaddha:",
  "sn7.15:1.6": "“This ascetic Gotama is teaching the Dhamma surrounded by a large assembly.",
  "sn7.15:1.7": "Let me approach him.",
  "sn7.15:1.8": "If the ascetic Gotama addresses me, then I will address him in turn.",
  "sn7.15:1.9": "But if he does not address me, neither will I address him.”",
  "sn7.15:1.10": "Then the brahmin Mānatthaddha approached the Blessed One and stood silently to one side,",
  "sn7.15:1.11": "but the Blessed One did not address him.",
  "sn7.15:1.12": "Then the brahmin Mānatthaddha, thinking,",
  "sn7.15:1.13": "“This ascetic Gotama doesn’t know anything,”",
  "sn7.15:1.14": "having known with his own mind the reflection in the brahmin’s mind, addressed the brahmin Mānatthaddha in verse:",
  "sn7.15:2.1": "“The fostering of conceit is never good",
  "sn7.15:2.2": "For one keen on his welfare, brahmin.",
  "sn7.15:2.3": "You should instead foster that purpose",
  "sn7.15:2.4": "Because of which you’ve come here.”",
  "sn7.15:3.1": "Then the brahmin Mānatthaddha, thinking,",
  "sn7.15:3.2": "“The ascetic Gotama knows my mind,”",
  "sn7.15:3.3": "prostrated himself right there with his head at the Blessed One’s feet.",
  "sn7.15:3.4": "Then that assembly was struck with amazement and the people said:",
  "sn7.15:3.5": "“It is wonderful indeed,",
  "sn7.15:3.6": "This brahmin Mānatthaddha does not pay homage to his mother and father,",
  "sn7.15:3.7": "yet he shows such supreme honour towards the ascetic Gotama.”",
  "sn7.15:3.8": "Then the Blessed One said to the brahmin Mānatthaddha:",
  "sn7.15:3.9": "“Enough, brahmin! Get up and sit in your own seat,",
  "sn7.15:3.10": "as your mind has confidence in me.”",
  "sn7.15:3.11": "Then the brahmin Mānatthaddha sat down in his own seat and addressed the Blessed One in verse:",
  "sn7.15:4.1": "“Towards whom should one avoid conceit?",
  "sn7.15:4.2": "Towards whom should one show reverence?",
  "sn7.15:4.3": "To whom should one be ever respectful?",
  "sn7.15:4.4": "Whom is it proper to venerate deeply?”",
  "sn7.15:5.1": "“First one’s own mother and father,",
  "sn7.15:5.2": "Then one’s eldest family brother,",
  "sn7.15:5.3": "Then one’s teacher as the fourth:",
  "sn7.15:5.4": "Towards these one should avoid conceit;",
  "sn7.15:5.5": "Towards these one should be reverential;",
  "sn7.15:5.6": "These should be well respected;",
  "sn7.15:5.7": "These it is good to venerate deeply.",
  "sn7.15:6.1": "“Having struck down conceit, humble,",
  "sn7.15:6.2": "One should pay homage to the arahants,",
  "sn7.15:6.3": "Those cool of heart, their tasks done,",
  "sn7.15:6.4": "The taintless ones, unsurpassed.”",
  "sn7.15:7.1": "When this was said, the brahmin Mānatthaddha said to the Blessed One:",
  "sn7.15:7.2": "“Magnificent, Master Gotama!",
  "sn7.15:7.3": "Let Master Gotama remember me as a lay follower who from today has gone for refuge for life.”"
}
