{
  "sn7.9:0.3": "Sundarika",
  "sn7.9:1.1": "On one occasion the Blessed One was dwelling among the Kosalans on the bank of the river Sundarika.",
  "sn7.9:1.2": "Now on that occasion the brahmin Sundarika Bhāradvāja was offering a fire sacrifice and performing the fire oblation on the bank of the river Sundarika.",
  "sn7.9:1.3": "Then the brahmin Sundarika Bhāradvāja, having offered the fire sacrifice and performed the fire oblation, rose from his seat and surveyed the four quarters all around, wondering:",
  "sn7.9:1.4": "“Who now might eat this sacrificial cake?”",
  "sn7.9:1.5": "The brahmin Sundarika Bhāradvāja saw the Blessed One sitting at the foot of a tree with his head covered.",
  "sn7.9:1.6": "Having seen him, he took the sacrificial cake in his left hand and the waterpot in his right hand and approached the Blessed One.",
  "sn7.9:1.7": "When the Blessed One heard the sound of the brahmin’s footsteps, he uncovered his head.",
  "sn7.9:1.8": "Then the brahmin Sundarika Bhāradvāja, thinking, “This worthy is shaven-headed, this worthy is a shaveling,” wanted to turn back;",
  "sn7.9:1.9": "but it occurred to him:",
  "sn7.9:1.10": "“Some brahmins here are also shaven-headed.",
  "sn7.9:1.11": "Let me approach him and inquire about his birth.”",
  "sn7.9:2.1": "Then the brahmin Sundarika Bhāradvāja approached the Blessed One and said to him:",
  "sn7.9:2.2": "“What is the worthy one’s birth?”",
  "sn7.9:3.1": "“Ask not of birth but ask of conduct:",
  "sn7.9:3.2": "Fire is indeed produced from any wood.",
  "sn7.9:3.3": "A resolute sage, though from low family,",
  "sn7.9:3.4": "Is a thoroughbred restrained by a sense of shame.",
  "sn7.9:4.1": "The sacrificer should invoke this one:",
  "sn7.9:4.2": "One tamed by truth, perfect by taming,",
  "sn7.9:4.3": "Who has reached the end of knowledge,",
  "sn7.9:4.4": "A fulfiller of the holy life.",
  "sn7.9:5.1": "Surely my sacrifice is well performed",
  "sn7.9:5.2": "As I have seen such a knowledge-master.",
  "sn7.9:5.3": "Because I had not seen those like yourself",
  "sn7.9:5.4": "Other people ate the sacrificial cake.",
  "sn7.9:6.1": "“Let Master Gotama eat.",
  "sn7.9:6.2": "The worthy is a brahmin.”",
  "sn7.9:7.1": "Food over which verses have been sung",
  "sn7.9:7.2": "…",
  "sn7.9:7.3": "For he is the field for one seeking merit.",
  "sn7.9:7.4": "“Then, Master Gotama, should I give this sacrificial cake to someone else?”",
  "sn7.9:8.1": "I do not see anyone, brahmin, in this world with its devas,",
  "sn7.9:8.2": "Māra, and Brahmā, in this generation with its ascetics and brahmins, its devas and humans,",
  "sn7.9:8.3": "who could eat and properly digest this sacrificial cake",
  "sn7.9:8.4": "except the Tathāgata or a disciple of the Tathāgata.",
  "sn7.9:9.1": "Therefore, brahmin, throw away the sacrificial cake in a place where there is sparse vegetation",
  "sn7.9:9.2": "or dispose of it in water where there are no living beings.",
  "sn7.9:9.3": "Then the brahmin Sundarika Bhāradvāja disposed of that sacrificial cake in water where there were no living beings.",
  "sn7.9:10.1": "When it was disposed of in the water, that sacrificial cake sizzled and hissed",
  "sn7.9:10.2": "and gave off steam and smoke.",
  "sn7.9:10.3": "Just as a ploughshare, heated all day, sizzles and hisses and gives off steam and smoke if placed in water,",
  "sn7.9:10.4": "so too that sacrificial cake, when disposed of in the water, sizzled and hissed and gave off steam and smoke.",
  "sn7.9:11.1": "Then the brahmin Sundarika Bhāradvāja, shocked and terrified, approached the Blessed One and stood to one side.",
  "sn7.9:11.2": "The Blessed One then addressed him with verses:",
  "sn7.9:12.1": "“When kindling wood, brahmin, do not imagine",
  "sn7.9:12.2": "This external deed brings purity;",
  "sn7.9:12.3": "For experts say no purity is gained",
  "sn7.9:12.4": "By one who seeks it outwardly.",
  "sn7.9:13.1": "“Having given up the fire made from wood,",
  "sn7.9:13.2": "I kindle, O brahmin, the inner light alone.",
  "sn7.9:13.3": "Always ablaze, my mind always concentrated,",
  "sn7.9:13.4": "I am an arahant living the holy life.",
  "sn7.9:14.1": "“Conceit, O brahmin, is your shoulder-load, <364>",
  "sn7.9:14.2": "Anger the smoke, false speech the ashes;",
  "sn7.9:14.3": "The tongue is the ladle, the heart the altar,",
  "sn7.9:14.4": "A well-tamed self is the light of a man.452",
  "sn7.9:15.1": "“The Dhamma is a lake with fords of virtue—",
  "sn7.9:15.2": "Limpid, praised by the good to the good—",
  "sn7.9:15.3": "Where the knowledge-masters go to bathe,",
  "sn7.9:15.4": "And, dry-limbed, cross to the far shore.",
  "sn7.9:16.1": "“Truth, Dhamma, restraint, the holy life,",
  "sn7.9:16.2": "Attainment of Brahmā based on the middle:",
  "sn7.9:16.3": "Pay homage, O brahmin, to the upright ones;",
  "sn7.9:16.4": "I call that person one impelled by Dhamma.”",
  "sn7.9:17.1": "When this was said, the brahmin Sundarika Bhāradvāja said to the Blessed One:",
  "sn7.9:17.2": "“Magnificent, Master Gotama!”…",
  "sn7.9:17.3": "And the Venerable Sundarika Bhāradvāja became one of the arahants."
}

