{
  "sn6.14:0.3": "Aruṇavatī",
  "sn6.14:1.1": "Thus have I heard.",
  "sn6.14:1.2": "On one occasion the Blessed One was dwelling at Sāvatthī …",
  "sn6.14:1.3": "There the Blessed One addressed the bhikkhus thus:",
  "sn6.14:1.4": "“Bhikkhus!”",
  "sn6.14:1.5": "“Venerable sir!” those bhikkhus replied.",
  "sn6.14:1.6": "The Blessed One said this:",
  "sn6.14:2.1": "“Bhikkhus, once in the past there was a king named Aruṇavā",
  "sn6.14:2.2": "whose capital was named Aruṇavatī.",
  "sn6.14:2.3": "The Blessed One Sikhī, the Arahant, the Perfectly Enlightened One, dwelt in dependence on the capital Aruṇavatī.",
  "sn6.14:2.4": "The chief pair of disciples of the Blessed One Sikhī were named Abhibhū and Sambhava, an excellent pair.",
  "sn6.14:2.5": "Then the Blessed One Sikhī addressed the bhikkhu Abhibhū:",
  "sn6.14:2.6": "‘Come, brahmin, let us go to a certain brahmā world until it is time for our meal. ’",
  "sn6.14:2.7": "‘Yes, venerable sir, ’ the bhikkhu Abhibhū replied.",
  "sn6.14:2.8": "“Then, bhikkhus, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, so the Blessed One Sikhī, the Arahant, the Perfectly Enlightened One, and the bhikkhu Abhibhū disappeared from the capital Aruṇavatī and reappeared in that brahmā world. ",
  "sn6.14:3.1": "Then the Blessed One Sikhī addressed the bhikkhu Abhibhū thus:",
  "sn6.14:3.2": "‘Give a Dhamma talk, brahmin, to Brahmā and to Brahmā’s retinue and to Brahmā’s assembly. ’",
  "sn6.14:3.3": "‘Yes, venerable sir, ’ the bhikkhu Abhibhū replied. Then, by means of a Dhamma talk, he instructed, exhorted, inspired, and gladdened Brahmā and Brahmā’s retinue and Brahmā’s assembly. ",
  "sn6.14:3.4": "Thereupon Brahmā and Brahmā’s retinue and  Brahmā’s assembly found fault with this, grumbled, and complained about it, saying:",
  "sn6.14:3.5": "‘It is wonderful indeed, sir! It is amazing indeed, sir! How  can a disciple teach the Dhamma in the very presence of the Teacher?’ ",
  "sn6.14:4.1": "“Then , bhikkhus , the Blessed One Sikhī addressed the bhikkhu Abhibhū thus:",
  "sn6.14:4.2": "‘Brahmin, Brahmā and Brahmā’s retinue and Brahmā’s assembly deplore this, saying,",
  "sn6.14:4.3": "“It is wonderful indeed, sir! It is amazing indeed, sir! How can a disciple teach the Dhamma in the very presence of the Teacher?” ",
  "sn6.14:4.4": "Well then, brahmin, stir up an even greater sense of urgency in Brahmā and in Brahmā’s retinue and in Brahmā’s assembly. ’ ",
  "sn6.14:4.5": "‘Yes, venerable sir, ’ the bhikkhu Abhibhū replied. Then he taught the Dhamma with his body visible, and with his body invisible, and with the lower half of his body visible and the upper half invisible, and with the upper half of his body visible and the lower half invisible. ",
  "sn6.14:4.6": "Thereupon, bhikkhus, Brahmā and Brahmā’s retinue and Brahmā’s assembly were struck with wonder and amazement, saying:",
  "sn6.14:4.7": "‘It is wonderful indeed, sir! It is amazing indeed, sir! How the ascetic has such great power and might!’ ",
  "sn6.14:5.1": "“Then, bhikkhus, the bhikkhu Abhibhū said to the Blessed One Sikhī, the Arahant, the Perfectly Enlightened One:",
  "sn6.14:5.2": "‘I recall, venerable sir, having made such a statement as this in the midst of the Bhikkhu Saṅgha:",
  "sn6.14:5.3": "“Friends, while standing in the brahmā world I can make my voice heard throughout the thousandfold world system. ’”",
  "sn6.14:5.4": "‘Now is the time for that, brahmin! Now is the time for that, brahmin! ",
  "sn6.14:5.5": "While standing in the brahmā world you should make your voice heard throughout the thousandfold world system. ’",
  "sn6.14:5.6": "‘Yes, venerable sir, ’ the bhikkhu Abhibhū replied. Then, while standing in the brahmā world, he recited these verses : ",
  "sn6.14:6.1": "“‘Arouse your energy, strive on!",
  "sn6.14:6.2": "Exert yourself in the Buddha’s Teaching.",
  "sn6.14:6.3": "Sweep away the army of Death",
  "sn6.14:6.4": "As an elephant does a hut of reeds.",
  "sn6.14:7.1": "“‘In this Dhamma and Discipline,",
  "sn6.14:7.2": "One who dwells diligently",
  "sn6.14:7.3": "Having abandoned the wandering on in birth,",
  "sn6.14:7.4": "Will make an end to suffering. ’",
  "sn6.14:8.1": "“Then, bhikkhus, having stirred up a sense of urgency in Brahmā and in Brahmā’s retinue and in Brahmā’s assembly, ",
  "sn6.14:8.2": "just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, the Blessed One Sikhī, the Arahant, the Perfectly Enlightened One, and the bhikkhu Abhibhū disappeared from that brahmā world and reappeared in the capital Aruṇavatī. ",
  "sn6.14:8.3": "Then the Blessed One Sikhī addressed the bhikkhus thus:",
  "sn6.14:8.4": "‘Bhikkhus, did you hear the verses that the bhikkhu Abhibhū recited while he was standing in the brahmā world?’",
  "sn6.14:8.5": "‘We did, venerable sir. ’",
  "sn6.14:8.6": "‘What were the verses that you heard, bhikkhus?’",
  "sn6.14:8.7": "‘We heard the verses of the bhikkhu Abhibhū thus:",
  "sn6.14:9.1": "“Arouse your energy, strive on!…",
  "sn6.14:10.4": "Will make an end to suffering. ”",
  "sn6.14:11.1": "Such were the verses that we heard the bhikkhu Abhibhū recite while he was standing in the brahmā world. ’",
  "sn6.14:11.2": "‘Good, good, bhikkhus!",
  "sn6.14:11.3": "It is good that you heard the verses that the bhikkhu Abhibhū recited while he was standing in the brahmā world. ’”",
  "sn6.14:12.1": "This is what the Blessed One said. Elated, those bhikkhus delighted in the Blessed One’s statement."
}