{
  "sn6.1:0.3": "Brahmā’s Request",
  "sn6.1:1.1": "Thus have I heard.",
  "sn6.1:1.2": "On one occasion the Blessed One was dwelling at Uruvelā on the bank of the river Nerañjarā at the foot of the Goatherd’s Banyan Tree just after he had become fully enlightened.",
  "sn6.1:1.3": "Then, while the Blessed One was alone in seclusion, a reflection arose in his mind thus:",
  "sn6.1:1.4": "“This Dhamma that I have discovered is deep, hard to see, hard to understand, peaceful and sublime, not within the sphere of reasoning, subtle, to be experienced by the wise. ",
  "sn6.1:1.5": "But this generation delights in adhesion, takes delight in adhesion, rejoices in adhesion.",
  "sn6.1:1.6": "For such a generation this state is hard to see, that is, specific conditionality, dependent origination.",
  "sn6.1:1.7": "And this state too is hard to see, that is, the stilling of all formations, the relinquishment of all acquisitions, the destruction of craving, dispassion, cessation, Nibbāna. ",
  "sn6.1:1.8": "If I were to teach the Dhamma and if others would not understand me, that would be wearisome for me, that would be troublesome. ” ",
  "sn6.1:1.9": "Thereupon these astounding verses, not heard before in the past, occurred to the Blessed One: ",
  "sn6.1:2.1": "“What I found with so much hardship;",
  "sn6.1:2.2": "Enough now with trying to teach",
  "sn6.1:2.3": "By those oppressed by lust and hate.",
  "sn6.1:2.4": "This Dhamma not easily understood,",
  "sn6.1:3.1": "“Going against the stream, subtle ",
  "sn6.1:3.2": "Deep,  hard to see, abstruse.",
  "sn6.1:3.3": "Those fired by lust, will never see this,",
  "sn6.1:3.4": "[They being] obscured by darkness.” ",
  "sn6.1:4.1": "As the Blessed One reflected thus, his mind inclined to living at ease, not to teaching the Dhamma. ",
  "sn6.1:5.1": "Then Brahmā Sahampati, having known with his own mind the reflection in the Blessed One’s mind, thought: ",
  "sn6.1:5.2": " “Alas, the world is lost! Alas, the world is to perish, in that the mind of the Tathāgata, the Arahant, the Perfectly Enlightened One, inclines to living at ease, not to teaching the Dhamma. ",
  "sn6.1:5.3": "” Then, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, Brahmā Sahampati disappeared from the brahmā world and reappeared before the Blessed One. ",
  "sn6.1:5.4": "He arranged his upper robe over one shoulder, knelt down with his right knee on the ground, raised his joined hands in reverential salutation towards the Blessed One, and said to him: ",
  "sn6.1:5.5": " “Venerable sir, let the Blessed One teach the Dhamma; let the Fortunate One teach the Dhamma.",
  "sn6.1:5.6": "There are beings with little dust in their eyes who are falling away because they do not hear the Dhamma.",
  "sn6.1:5.7": "There will be those who will understand the Dhamma. ”",
  "sn6.1:5.8": "This is what Brahmā Sahampati said. Having said this, he further said this: ",
  "sn6.1:6.1": "“In the past there appeared among the Magadhans",
  "sn6.1:6.2": "An impure Dhamma devised by those still stained.",
  "sn6.1:6.3": "Throw open this door to the Deathless!",
  "sn6.1:6.4": "Let them hear The Dhamma that the Stainless One discovered.",
  "sn6.1:7.1": "“Just as one standing on a mountain peak",
  "sn6.1:7.2": "Might see below the people all around,",
  "sn6.1:7.3": "So, made of the Dhamma, O wise one, ",
  "sn6.1:7.4": "Ascend this palace, universal eye, ",
  "sn6.1:7.5": "Being yourself free from sorrow, these people submerged in sorrow,",
  "sn6.1:7.6": "Behold beings oppressed by birth and decay. ”",
  "sn6.1:8.1": "“Rise up, O hero, victor in battle! ",
  "sn6.1:8.2": "O caravan leader, debt-free one, wander in the world.",
  "sn6.1:8.3": "Teach the Dhamma, O Blessed One:",
  "sn6.1:8.4": "There will be those who will understand. ”",
  "sn6.1:9.1": "Then the Blessed One, having understood Brahmā’s request, out of compassion for beings surveyed the world with the eye of a Buddha.",
  "sn6.1:9.2": "As he did so, the Blessed One saw beings with little dust in their eyes and with much dust in their eyes, with keen faculties and with dull faculties, with good qualities and with bad qualities, easy to teach and difficult to teach, and a few who dwelt seeing blame and fear in the other world. ",
  "sn6.1:9.3": "Just as in a pond of blue or red or white lotuses, some lotuses might be born in the water, grow up in the water, and thrive while submerged in the water, without rising up from the water; some lotuses might be born in the water, grow up in the water, and stand at an even level with the water; some lotuses might be born in the water and grow up in the water, but would rise up from the water and stand without being soiled by the water—so too, ",
  "sn6.1:9.4": "surveying the world with the eye of a Buddha, the Blessed One saw beings with little dust in their eyes and with much dust in their eyes, with keen faculties and with dull faculties, with good qualities and with bad qualities, easy to teach and hard to teach, and a few who dwelt seeing blame and fear in the other world. ",
  "sn6.1:9.5": "Having seen this, he answered Brahmā Sahampati in verse:",
  "sn6.1:10.1": "“Open to them are the doors to the Deathless:",
  "sn6.1:10.2": "Let those who have ears release faith.",
  "sn6.1:10.3": "Foreseeing trouble, O Brahmā, I did not speak",
  "sn6.1:10.4": "The refined, sublime Dhamma among human beings. ”",
  "sn6.1:11.1": "Then Brahmā Sahampati, thinking, “The Blessed One has given his consent [to my request] regarding the teaching of the Dhamma, ” paid homage to the Blessed One and disappeared right there. "
}