{
  "sn6.4:0.3": "Brahmā Baka",
  "sn6.4:1.1": "Thus have I heard.",
  "sn6.4:1.2": "On one occasion the Blessed One was dwelling at Sāvatthī in Jeta’s Grove, Anāthapiṇḍika’s Park.",
  "sn6.4:1.3": "Now on that occasion the following evil speculative view had arisen in Brahmā Baka: “This is permanent, this is stable,",
  "sn6.4:1.4": "this is eternal, this is complete, this is imperishable. Indeed, this is where one is not born, does not age, does not die, does not pass away, and is not reborn; and there is no other escape superior to this. ” ",
  "sn6.4:2.1": "Then, having known with his own mind the reflection in Brahmā Baka’s mind, just as quickly as a strong man might extend his drawn-in arm or draw in his extended arm, the Blessed One disappeared from Jeta’s Grove and reappeared in that brahmā world. ",
  "sn6.4:2.2": "Brahmā Baka saw the Blessed One coming in the distance and said to him :",
  "sn6.4:2.4": " “Come , dear sir! Welcome, dear sir! ",
  "sn6.4:2.5": "It has been a long time, dear sir, since you took the opportunity of coming here.",
  "sn6.4:2.6": "Indeed, dear sir, this is permanent, this is stable, this is eternal, this is complete, this is imperishable. Indeed, this is where one is not born, does not age, does not die, does not pass away, and is not reborn; and there is no other escape superior to this. ” ",
  "sn6.4:3.1": "When this was said, the Blessed One said to Brahmā Baka:",
  "sn6.4:3.2": " “Alas, sir, Brahmā Baka is immersed in ignorance! Alas, sir, Brahmā Baka is immersed in ignorance, ",
  "sn6.4:3.3": "in so far as he will say of what is actually impermanent that it is permanent; and will say of what is actually unstable that it is stable; and will say of what is actually noneternal that it is eternal; and will say of what is actually incomplete that it is complete; and will say of what is actually perishable that it is imperishable; ",
  "sn6.4:3.4": "and with reference to [a realm] where one is born, ages, dies, passes away, and is reborn, will say thus:",
  "sn6.4:3.5": " ‘Indeed, this is where one is not born, does not age, does not die, does not pass away, and is not reborn’; ",
  "sn6.4:3.6": " and when there is another escape superior to this, will say, ‘There is no other escape superior to this. ’” ",
  "sn6.4:4.1": "[Brahmā Baka: ]  “We seventy-two, Gotama, were merit-makers;",
  "sn6.4:4.2": "Now we wield power, beyond birth and aging.",
  "sn6.4:4.3": "This, knowledge-master, is our final attainment of Brahmā.",
  "sn6.4:4.4": "Many are the people who yearn for us. ”",
  "sn6.4:5.1": "[The Blessed One: ]  “The life span here is short,",
  "sn6.4:5.2": "Though you, Baka, imagine it is long.",
  "sn6.4:5.3": "A hundred thousand nirabbudas.",
  "sn6.4:5.4": "I know, O Brahmā, your life span to be",
  "sn6.4:6.1": "[Brahmā Baka: ]  “O Blessed One, [you say]: ‘I am the one of infinite vision",
  "sn6.4:6.2": "Who has overcome birth, aging, and sorrow.",
  "sn6.4:6.3": "’ What was my ancient practice of vow and virtue?",
  "sn6.4:6.4": "Tell me this so I might understand. ”",
  "sn6.4:7.1": "[The Blessed One: ]  “You gave drink to many people",
  "sn6.4:7.2": "Who were thirsty, afflicted by heat:",
  "sn6.4:7.3": "That was your ancient practice of vow and virtue,",
  "sn6.4:7.4": "Which I recollect as if just waking up.",
  "sn6.4:8.1": "“When people were abducted at Antelope Bank,",
  "sn6.4:8.2": "You released the captives being led away.",
  "sn6.4:8.3": "That was your ancient practice of vow and virtue,",
  "sn6.4:8.4": "Which I recollect as if just waking up.",
  "sn6.4:9.1": "“When a ship was seized on the river Ganges",
  "sn6.4:9.2": "By a fierce nāga longing for human flesh,",
  "sn6.4:9.3": "You freed it forcefully by a valiant act:",
  "sn6.4:9.4": "That was your ancient practice of vow and virtue,",
  "sn6.4:9.5": "Which I recollect as if just waking up.",
  "sn6.4:10.1": "“I was your apprentice named Kappa;",
  "sn6.4:10.2": "You thought him intelligent and devout:",
  "sn6.4:10.3": "That was your ancient practice of vow and virtue,",
  "sn6.4:10.4": "Which I recollect as if just waking up. ”",
  "sn6.4:11.1": "[Brahmā Baka: ]   “Surely you know this life span of mine;",
  "sn6.4:11.2": "The others too you know, thus you’re the Buddha.",
  "sn6.4:11.3": "Thus this blazing majesty of yours",
  "sn6.4:11.4": "Illumines even the brahmā world. ”"
}