{
  "sn3.20:0.3": "Childless",
  "sn3.20:3.1": "“So it is, great king! So it is, great king! ",
  "sn3.20:3.2": "Once in the past, great king, that financier householder provided a paccekabuddha named Tagarasikhī with almsfood.",
  "sn3.20:3.3": "Having said, ‘Give alms to the ascetic, ’ he rose from his seat and departed.",
  "sn3.20:3.4": "But after giving, he later felt regret and thought:",
  "sn3.20:3.5": "‘It would have been better if the slaves or workers had eaten that almsfood!’ Moreover,",
  "sn3.20:3.6": "he murdered his brother’s only son for the sake of his fortune.",
  "sn3.20:4.1": "“Because that financier householder provided the paccekabuddha Tagarasikhī with almsfood, as a result of that kamma he was reborn seven times in a good destination, in the heavenly world. ",
  "sn3.20:4.2": "As a residual result of that same kamma, he obtained the position of financier seven times in this same city of Sāvatthī.",
  "sn3.20:4.3": "But because that financier householder later felt regret about giving,",
  "sn3.20:4.4": "as a result of that kamma his mind did not incline to the enjoyment of excellent food, excellent clothing, and excellent vehicles, nor to the enjoyment of excellent items among the five cords of sensual pleasure. ",
  "sn3.20:4.5": "And because that financier householder murdered his brother’s only son for the sake of his fortune, as a result of that kamma he was tormented in hell for many years, for many hundreds of years, for many thousands of years, for many hundreds of thousands of years. ",
  "sn3.20:4.6": "As a residual result of that same kamma, he has furnished the royal treasury with this seventh heirless fortune.",
  "sn3.20:4.7": "“The old merit of that financier householder has been utterly exhausted, and he had not accumulated any fresh merit.",
  "sn3.20:4.8": "But today, great king, the financier householder is being roasted in the Great Roruva Hell. ” ",
  "sn3.20:4.9": "“So, venerable sir, that financier householder has been reborn in the Great Roruva Hell?”",
  "sn3.20:4.10": "“Yes, great king, that financier householder has been reborn in the Great Roruva Hell. ",
  "sn3.20:5.1": "“Grain, wealth, silver, gold,",
  "sn3.20:5.2": "Or whatever other possessions there are,",
  "sn3.20:5.3": "Slaves, workers, messengers,",
  "sn3.20:5.4": "And those who live as one’s dependants:",
  "sn3.20:6.1": "Without taking anything one must go,",
  "sn3.20:6.2": "Everything must be left behind.",
  "sn3.20:6.3": "“But what one has done by body,",
  "sn3.20:6.4": "Or by speech or mind:",
  "sn3.20:7.1": "This is what is truly one’s own,",
  "sn3.20:7.2": "This one takes when one goes;",
  "sn3.20:7.3": "This is what follows one along",
  "sn3.20:7.4": "Like a shadow that never departs.",
  "sn3.20:8.1": "“Therefore one should do what is good",
  "sn3.20:8.2": "As a collection for the future life.",
  "sn3.20:8.3": "Merits are the support for living beings",
  "sn3.20:8.4": "[When they arise] in the other world. ”"
}