{
  "sn3.19:0.3": "Childless",
  "sn3.19:1.1": "At Sāvatthī.",
  "sn3.19:1.2": "Then King Pasenadi of Kosala approached the Blessed One, paid homage to him, and sat down to one side. The Blessed One then said to him: ",
  "sn3.19:1.3": "“Where are you coming from, great king, in the middle of the day?”",
  "sn3.19:2.1": "“Here, venerable sir, a financier householder in Sāvatthī has died.",
  "sn3.19:2.2": "I have come after conveying his heirless fortune to the palace, as he died intestate. ",
  "sn3.19:2.3": "There were eighty lakhs of gold, not to speak of silver, ",
  "sn3.19:2.4": "and yet, venerable sir, that financier householder’s meals were like this: ",
  "sn3.19:2.5": "he ate red rice along with sour gruel.",
  "sn3.19:2.6": "His clothes were like this:",
  "sn3.19:2.7": "he wore a three-piece hempen garment.",
  "sn3.19:2.8": "His vehicle was like this:",
  "sn3.19:2.9": "he went about in a dilapidated little cart with a leaf awning. ”",
  "sn3.19:3.1": "“So it is, great king! So it is, great king! ",
  "sn3.19:3.2": "When an inferior man gains abundant wealth, he does not make himself happy and pleased, nor does he make his mother and father happy and pleased, nor his wife and children, nor his slaves, workers, and servants, nor his friends and colleagues; nor does he establish an offering for ascetics and brahmins, one leading upwards, of heavenly fruit, resulting in happiness, conducive to heaven. ",
  "sn3.19:3.3": "Because his wealth is not being used properly, kings take it away, or thieves take it away, or fire burns it, or water carries it away, or unloved heirs take it. ",
  "sn3.19:3.4": "Such being the case, great king, that wealth, not being used properly, goes to waste, not to utilization. ",
  "sn3.19:4.1": "“Suppose, great king, in a place uninhabited by human beings, there was a lotus pond with clear, cool, sweet, clean water, with good fords, delightful; ",
  "sn3.19:4.2": " but no people would take that water, or drink it, or bathe in it, or use it for any purpose. ",
  "sn3.19:4.3": "In such a case, great king, that water, not being used properly, would go to waste, not to utilization. ",
  "sn3.19:4.4": "So too, great king, when an inferior man gains abundant wealth . . . that wealth, not being used properly, goes to waste, not to utilization. ",
  "sn3.19:5.1": "“But, great king, when a superior man gains abundant wealth, he makes himself happy and pleased, and he makes his mother and father happy and pleased, and his wife and children, and his slaves, workers, and servants, and his friends and colleagues;  and he establishes an offering for ascetics and brahmins, one leading upwards, of heavenly fruit, resulting in happiness, conducive to heaven. ",
  "sn3.19:5.2": "Because his wealth is being used properly, kings do not take it away, thieves do not take it away, fire does not burn it, water does not carry it away, and unloved heirs do not take it. ",
  "sn3.19:5.3": "Such being the case, great king, that wealth, being used properly, goes to utilization, not to waste.",
  "sn3.19:6.1": "“Suppose, great king, not far from a village or a town, there was a lotus pond with clear, cool, sweet, clean water, with good fords, delightful; ",
  "sn3.19:6.2": " and people would take that water, and drink it, and bathe in it, and use it for their purposes.",
  "sn3.19:6.3": "In such a case, great king, that water, being used properly, would go to utilization, not to waste.",
  "sn3.19:6.4": "So too, great king, when a superior man gains abundant wealth . . . that wealth, being used properly, goes to utilization, not to waste. ",
  "sn3.19:7.1": "“As cool water in a desolate place",
  "sn3.19:7.2": "Evaporates without being drunk,",
  "sn3.19:7.3": "So when a scoundrel acquires wealth",
  "sn3.19:7.4": "He neither enjoys himself nor gives.",
  "sn3.19:8.1": "“But when the wise man obtains wealth",
  "sn3.19:8.2": "He enjoys himself and does his duty.",
  "sn3.19:8.3": "Having supported his kin, free from blame,",
  "sn3.19:8.4": "That noble man goes to a heavenly state. ”"
}