{
  "sn3.25:0.3": "The Simile of the Mountain",
  "sn3.25:1.1": "At Sāvatthī.",
  "sn3.25:1.2": "The Blessed One said to him as he was sitting to one side:",
  "sn3.25:1.3": "“Now where are you coming from, great king, in the middle of the day?”",
  "sn3.25:1.4": "“Just now, venerable sir, I have been engaged in those affairs of kingship typical for head-anointed khattiya kings, who are intoxicated with the intoxication of sovereignty, who are obsessed by greed for sensual pleasures, who have attained stable control in their country, and who rule having conquered a great sphere of territory on earth.” ",
  "sn3.25:2.1": "“What do you think, great king?",
  "sn3.25:2.2": "Here, a man would come to you from the east, one who is trustworthy and reliable; ",
  "sn3.25:2.3": "having approached, he would tell you:",
  "sn3.25:2.4": "‘For sure, great king, you should know this: I am coming from the east,",
  "sn3.25:2.5": "and there I saw a great mountain high as the clouds coming this way, crushing all living beings.",
  "sn3.25:2.6": "Do whatever you think should be done, great king.",
  "sn3.25:2.7": "’Then a second man would come to you from the west …",
  "sn3.25:2.8": "Then a third man would come to you from the north …",
  "sn3.25:2.9": "Then a fourth man would come to you from the south, one who is trustworthy and reliable;",
  "sn3.25:2.10": "having approached, he would tell you:",
  "sn3.25:2.11": "‘For sure, great king, you should know this: I am coming from the south,",
  "sn3.25:2.12": "and there I saw a great mountain high as the clouds coming this way, crushing all living beings.",
  "sn3.25:2.13": "Do whatever you think should be done, great king.",
  "sn3.25:2.14": "’If, great king, such a great peril should arise, such a terrible destruction of human life, the human state being so difficult to obtain, what should be done?” ",
  "sn3.25:3.1": "“If, venerable sir, such a great peril should arise, such a terrible destruction of human life, the human state being so difficult to obtain, what else should be done but to live by the Dhamma, to live righteously, and to do wholesome and meritorious deeds?” ",
  "sn3.25:4.1": "“I inform you, great king, I announce to you, great king: aging and death are rolling in on you. ",
  "sn3.25:4.2": "When aging and death are rolling in on you, great king, what should be done?” ",
  "sn3.25:4.3": "“As aging and death are rolling in on me, venerable sir, what else should be done but to live by the Dhamma, to live righteously, and to do wholesome and meritorious deeds? ",
  "sn3.25:4.4": "“There are, venerable sir, elephant battles [fought by] head-anointed khattiya kings, who are intoxicated with the intoxication of sovereignty, who are obsessed by greed for sensual pleasures, who have attained stable control in their country, and who rule having conquered a great sphere of territory on earth;",
  "sn3.25:4.5": "but there is no place for those elephant battles, no scope for them, when aging and death are rolling in. ",
  "sn3.25:4.6": "Whatever there are, venerable sir, of these head-anointed khattiya kings … ",
  "sn3.25:4.7": "There are, venerable sir, cavalry battles … ",
  "sn3.25:4.8": "There are chariot battles …",
  "sn3.25:4.9": "infantry battles …",
  "sn3.25:4.10": "but there is no place for those infantry battles, no scope for them, when aging and death are rolling in. ",
  "sn3.25:4.11": "In this royal court, venerable sir, there are counsellors who, when the enemies arrive, are capable of dividing them by subterfuge; ",
  "sn3.25:4.12": "but there is no place for those battles of subterfuge, no scope for them, when aging and death are rolling in. ",
  "sn3.25:4.13": "In this royal court, venerable sir, there exists abundant bullion and gold stored in vaults and depositories, and with such wealth we are capable of mollifying the enemies when they come; but there is no place for those battles of wealth, ",
  "sn3.25:4.14": "no scope for them, when aging and death are rolling in. As aging and death are rolling in on me, ",
  "sn3.25:4.15": "venerable sir, what else should be done but to live by the Dhamma, to live righteously, and to do wholesome and meritorious deeds?” ",
  "sn3.25:5.1": "“So it is, great king! So it is, great king! ",
  "sn3.25:5.2": "As aging and death are rolling in on you, what else should be done but to live by the Dhamma, to live righteously, and to do wholesome and meritorious deeds?” ",
  "sn3.25:5.3": "This is what the Blessed One said.",
  "sn3.25:5.4": "Having said this, the Fortunate One, the Teacher, further said this:",
  "sn3.25:6.1": "“Just as mountains of solid rock,",
  "sn3.25:6.2": "Massive, reaching to the sky,",
  "sn3.25:6.3": "Might draw together from all sides,",
  "sn3.25:6.4": "Crushing all in the four quarters—",
  "sn3.25:7.1": "So aging and death come",
  "sn3.25:7.2": "Rolling over living beings—",
  "sn3.25:7.3": "Khattiyas,  brahmins,  vessas, ",
  "sn3.25:7.4": "suddas, Caṇḍālas and scavengers:",
  "sn3.25:7.5": "They spare none along the way",
  "sn3.25:7.6": "But come crushing everything.",
  "sn3.25:8.1": "“There’s no ground there for elephant troops,",
  "sn3.25:8.2": "For chariot troops and infantry.",
  "sn3.25:8.3": "One can’t defeat them by subterfuge,",
  "sn3.25:8.4": "Or buy them off by means of wealth.",
  "sn3.25:9.1": "“Therefore a person of wisdom here,",
  "sn3.25:9.2": "Out of regard for his own good,",
  "sn3.25:9.3": "In the Buddha, Dhamma, and Saṅgha.",
  "sn3.25:9.4": "Steadfast, should settle faith",
  "sn3.25:10.1": "“When one conducts oneself by Dhamma, by body,",
  "sn3.25:10.2": "speech,  and mind,",
  "sn3.25:10.3": "They praise one here in the present life,",
  "sn3.25:10.4": "And after death one rejoices in heaven. ”"
}