{
  "sn3.18:0.3": "Diligence",
  "sn3.18:1.1": "At Sāvatthī.",
  "sn3.18:1.2": "Sitting to one side, King Pasenadi of Kosala said to the Blessed One:",
  "sn3.18:1.3": "“Here, venerable sir, while I was alone in seclusion, the following reflection arose in my mind: ",
  "sn3.18:1.4": "‘The Dhamma has been well expounded by the Blessed One, and that is for one with good friends, good companions, good comrades, not for one with bad friends, bad companions, bad comrades. ’” ",
  "sn3.18:2.1": "“So it is, great king! So it is, great king! ",
  "sn3.18:2.2": "The Dhamma has been well expounded by me, and that is for one with good friends, good companions, good comrades, not for one with bad friends, bad companions, bad comrades. ",
  "sn3.18:3.1": "“On one occasion, great king, I was living among the Sakyans, where there is a town of the Sakyans named Nāgaraka. ",
  "sn3.18:3.2": "Then the bhikkhu Ānanda approached me, paid homage to me, sat down to one side, and said:",
  "sn3.18:3.3": "‘Venerable sir, this is half of the holy life, that is, good friendship, good companionship, good comradeship.’",
  "sn3.18:4.1": "“When this was said, great king, I told the bhikkhu Ānanda:",
  "sn3.18:4.2": "‘Not so, Ānanda! Not so, Ānanda! ",
  "sn3.18:4.3": "This is the entire holy life, Ānanda, that is, good friendship, good companionship, good comradeship.",
  "sn3.18:4.4": "When a bhikkhu has a good friend, a good companion, a good comrade, it is to be expected that he will develop and cultivate the Noble Eightfold Path. ",
  "sn3.18:5.1": "And how, Ānanda, does a bhikkhu who has a good friend, a good companion, a good comrade, develop and cultivate the Noble Eightfold Path? ",
  "sn3.18:5.2": "Here, Ānanda, a bhikkhu develops right view, which is based upon seclusion, dispassion, and cessation, maturing in release. He develops right intention … right speech … right action … right livelihood … right effort … right mindfulness … right concentration, which is based upon seclusion, dispassion, and cessation, maturing in release.",
  "sn3.18:5.3": "It is in this way, Ānanda, that a bhikkhu who has a good friend, a good companion, a good comrade, develops and cultivates the Noble Eightfold Path. ",
  "sn3.18:5.4": "“‘By the following method too, Ānanda, it may be understood how the entire holy life is good friendship, good companionship, good comradeship: ",
  "sn3.18:6.1": "by relying upon me as a good friend, Ānanda, beings subject to birth are freed from birth; beings subject to aging are freed from aging; beings subject to illness are freed from illness; beings subject to death are freed from death; beings subject to sorrow, lamentation, pain, displeasure, and despair are freed from sorrow, lamentation, pain, displeasure, and despair. ",
  "sn3.18:6.2": "By this method, Ānanda, it may be understood how the entire holy life is good friendship, good companionship, good comradeship.’",
  "sn3.18:7.1": "“Therefore, great king, you should train yourself thus:",
  "sn3.18:7.2": "‘I will be one who has good friends, good companions, good comrades.’",
  "sn3.18:7.3": "It is in such a way that you should train yourself.",
  "sn3.18:8.1": "“When, great king, you have good friends, good companions, good comrades, you should dwell with one thing for support:",
  "sn3.18:8.2": "diligence in wholesome states.",
  "sn3.18:9.1": "“When, great king, you are dwelling diligently, with diligence for support, your retinue of harem women will think thus: ",
  "sn3.18:9.2": "‘The king dwells diligently, with diligence for support.",
  "sn3.18:9.3": "Come now, let us also dwell diligently, with diligence for support.’",
  "sn3.18:10.1": "“When, great king, you are dwelling diligently, with diligence for support, your retinue of khattiya vassals will think thus … ",
  "sn3.18:11.1": "your troops will think thus: … ",
  "sn3.18:12.1": "your subjects in town and countryside will think thus:",
  "sn3.18:12.2": "‘The king dwells diligently, with diligence for support.",
  "sn3.18:12.3": "Come now, let us also dwell diligently, with diligence for support.’",
  "sn3.18:13.1": "“When, great king, you are dwelling diligently, with diligence for support, you yourself will be guarded and protected, ",
  "sn3.18:13.2": "your retinue of harem women will be guarded and protected, your treasury and storehouse will be guarded and protected.",
  "sn3.18:14.1": "“For one who desires lofty riches",
  "sn3.18:14.2": "Following in succession,",
  "sn3.18:14.3": "The wise praise diligence",
  "sn3.18:14.4": "In doing deeds of merit.",
  "sn3.18:14.5": "“The wise person who is diligent",
  "sn3.18:15.1": "The good visible in this very life",
  "sn3.18:15.2": "And the good of the future life.",
  "sn3.18:15.3": "The steadfast one, by attaining the good,",
  "sn3.18:15.4": "Is called a person of wisdom. ”"
}