{
  "sn3.12:0.3": "Five Kings",
  "sn3.12:1.1": "At Sāvatthī.",
  "sn3.12:1.2": "Now on that occasion five kings headed by King Pasenadi were enjoying themselves supplied and endowed with the five cords of sensual pleasure when this conversation arose among them:",
    "sn3.12:1.3":"“What is the chief of sensual pleasures?”",
  "sn3.12:1.4": "Some among them said:",
  "sn3.12:1.5": "“Forms are the chief of sensual pleasures. ”",
  "sn3.12:1.6": "Some said:",
  "sn3.12:1.7": "“Sounds are the chief. ”",
  "sn3.12:1.9": "“Odours are the chief. ”",
  "sn3.12:1.11": "“Tastes are the chief. ”",
  "sn3.12:1.13": "“Tactile objects are the chief. ”",
  "sn3.12:1.14": "Since those kings were unable to convince one another,",
  "sn3.12:2.1": "King Pasenadi of Kosala said to them:",
  "sn3.12:2.2": "“Come, dear sirs, let us approach the Blessed One and question him about this matter.",
  "sn3.12:2.3": "As the Blessed One answers us, so we should remember it. ” ",
  "sn3.12:2.4": "“All right, dear sir, ” those kings replied. ",
  "sn3.12:3.1": "Then those five kings, headed by King Pasenadi, approached the Blessed One, paid homage to him, and sat down to one side. King Pasenadi then reported their entire discussion to the Blessed One, asking: ",
  "sn3.12:3.3": " “What now, venerable sir, is the chief of sensual pleasures?”",
  "sn3.12:4.1": "“Great king, I say that what is chief among the five cords of sensual pleasure is determined by whatever is most agreeable.",
  "sn3.12:4.2": "Those same forms that are agreeable to one person, great king, are disagreeable to another.",
  "sn3.12:4.3": "When one is pleased and completely satisfied with certain forms, then one does not yearn for any other form higher or more sublime than those forms.",
  "sn3.12:4.4": "For him those forms are then supreme;",
  "sn3.12:4.5": " for him those forms are unsurpassed.",
  "sn3.12:5.1": "“Those same sounds …",
  "sn3.12:6.1": "Those same odours …",
  "sn3.12:7.1": "Those same tastes …",
  "sn3.12:8.1": "Those same tactile objects that are agreeable to one person, great king, are disagreeable to another.",
  "sn3.12:8.2": "When one is pleased and completely satisfied with certain tactile objects, then one does not yearn for any other tactile object higher or more sublime than those tactile objects. For him those tactile objects are then supreme; for him those tactile objects are unsurpassed.   ",
  "sn3.12:9.1": "Now on that occasion the lay follower Candanaṅgalika was sitting in that assembly.",
  "sn3.12:9.2": "Then the lay follower Candanaṅgalika rose from his seat, arranged his upper robe over one shoulder, and, raising his joined hands in reverential salutation towards the Blessed One, said to him: ",
  "sn3.12:9.3": " “An inspiration has come to me, Blessed One! An inspiration has come to me, Fortunate One!” ",
  "sn3.12:9.4": "“Then express your inspiration, Candanaṅgalika, ”, the Blessed One said.",
  "sn3.12:10.1": "Then the lay follower Candanaṅgalika, in the presence of the Blessed One, extolled him with an appropriate verse: ",
  "sn3.12:11.1": "“As the fragrant red lotus Kokanada",
  "sn3.12:11.2": "Blooms in the morning, its fragrance unspent,",
  "sn3.12:11.3": "Behold Aṅgīrasa, the Radiant One,",
  "sn3.12:11.4": "Like the sun beaming in the sky. ”",
  "sn3.12:12.1": "Then those five kings bestowed five upper robes upon the lay follower Candanaṅgalika.",
  "sn3.12:12.2": "But the lay follower Candanaṅgalika  bestowed those five upper robes upon the Blessed One."
}