{
  "sn3.22:0.3": "Grandmother",
  "sn3.22:1.1": "At Sāvatthī.",
  "sn3.22:1.2": "Then, in the middle of the day, King Pasenadi of Kosala approached the Blessed One. The Blessed One said to him as he was sitting to one side: ",
  "sn3.22:1.3": "“Where are you coming from, great king, in the middle of the day?”",
  "sn3.22:2.1": "“Venerable sir, my grandmother has died. She was old, aged, burdened with years, advanced in life, come to the last stage, years from birth. ",
  "sn3.22:2.2": "Venerable sir, my grandmother was dear and beloved to me.",
  "sn3.22:2.3": "If, venerable sir, by means of the elephant-gem I could have redeemed her from death, I would have given away even the elephant-gem ",
  "sn3.22:2.4": "so that she would not have died.",
  "sn3.22:2.5": "If by means of the horse-gem I could have redeemed her from death .",
  "sn3.22:2.7": "If by a prize village I could have redeemed her from death .",
  "sn3.22:2.9": "If by means of the country I could have redeemed her from death, I would have given away even the country",
  "sn3.22:2.10": "so that she would not have died.",
  "sn3.22:2.11": "“All beings, great king, are subject to death, terminate in death, and cannot escape death. ” ",
  "sn3.22:2.12": "“It is wonderful, venerable sir! It is amazing, venerable sir! ",
  "sn3.22:2.13": "How well this has been stated by the Blessed One:",
  "sn3.22:2.14": "‘All beings, great king, are subject to death, terminate in death, and cannot escape death. ’” ",
  "sn3.22:3.1": "“So it is, great king! So it is, great king! ",
  "sn3.22:3.2": "All beings, great king, are subject to death, terminate in death, and cannot escape death.",
  "sn3.22:3.3": "Just as all the potter’s vessels, whether unbaked or baked, are subject to a breakup, terminate in their breakup, and cannot escape their breakup, ",
  "sn3.22:3.4": "so all beings are subject to death, terminate in death, and cannot escape death.",
  "sn3.22:4.1": "“All beings will die,",
  "sn3.22:4.2": "For life ends in death.",
  "sn3.22:4.3": "They will fare according to their deeds,",
  "sn3.22:4.4": "Reaping the fruits of their merit and evil:",
  "sn3.22:4.5": "The doers of evil go to hell,",
  "sn3.22:4.6": "The doers of merit to a happy realm.",
  "sn3.22:5.1": "“Therefore one should do what is good",
  "sn3.22:5.2": "As a collection for the future life.",
  "sn3.22:5.3": "Merits, [When they arise] in the other world, ",
  "sn3.22:5.4": "are the support for living beings.”"
}