{
  "ps1.0:0.1": "Path of Discrimination",
  "ps1.0:0.2": "1 Great Division",
  "ps1.0:0.3": "1.0 Mātikā",
  "ps1.0:1.1": "Understanding of applying the ear is knowledge of what consists in the heard (learnt)",
  "ps1.0:2.1": "Understanding of restraint after hearing (learning) is knowledge of what consists in virtue.",
  "ps1.0:3.1": "Understanding of concentrating after restraining is knowledge of what consists in the development of concentration",
  "ps1.0:4.1": "Understanding of embracing conditions is knowledge of causal relationship of ideas.",
  "ps1.0:5.1": "Understanding of defining past, future, and present ideas, after generalization, is knowledge of comprehension.",
  "ps1.0:6.1": "Understanding of contemplating presently-arisen ideas' change is knowledge of contemplation of rise and fall.",
  "ps1.0:7.1": "Understanding of contemplating dissolution after reflecting on an object is knowledge of insight.",
  "ps1.0:8.1": "Understanding of appearance as terror is knowledge of danger.",
  "ps1.0:9.1": "Understanding of desire for deliverance, of reflexion, and of composure, is knowledge of the kinds of equanimity about formations.",
  "ps1.0:10.1": "Understanding of emergence and turning away from the external is change-of-lineage knowledge",
  "ps1.0:11.1": "Understanding of emergence and turning away from both (the external and internal) is knowledge of the path.",
  "ps1.0:12.1": "Understanding of tranquillization of the tasks is knowledge of fruition.",
  "ps1.0:13.1": "Understanding of contemplating what is cut off is knowledge of deliverance.",
  "ps1.0:14.1": "Understanding of insight into ideas when arrived at is knowledge of reviewing.",
  "ps1.0:15.1": "Understanding of defining internally is knowledge of difference in the physical basis.",
  "ps1.0:16.1": "Understanding of defining externally is knowledge of difference in the domains [of the physical bases].",
  "ps1.0:17.1": "Understanding of defining behaviour is knowledge of difference in behaviour (of consciousness).",
  "ps1.0:18.1": "Understanding of defining four ideas is knowledge of difference in plane.",
  "ps1.0:19.1": "Understanding of defining nine ideas is knowledge of difference in idea.",
  "ps1.0:20.1": "Understanding as direct-knowledge is knowledge of the meaning of what-is-known.",
  "ps1.0:21.1": "Understanding as full-understanding is knowledge of the meaning of judgment (investigation).",
  "ps1.0:22.1": "Understanding as abandoning is knowledge in the sense of giving up.",
  "ps1.0:23.1": "Understanding as developing is knowledge in the sense or single function (taste).",
  "ps1.0:24.1": "Understanding as realizing is knowledge in the sense of sounding.",
  "ps1.0:25.1": "Understanding of difference in meaning is knowledge of discrimination of meaning.",
  "ps1.0:26.1": "Understanding of difference in ideas is knowledge of discrimination of ideas.",
  "ps1.0:27.1": "Understanding of difference in language is knowledge of discrimination of language.",
  "ps1.0:28.1": "Understanding of difference in intelligence is knowledge of discrimination of perspicuity.",
  "ps1.0:29.1": "Understanding of difference in abiding is knowledge of the meaning of abiding.",
  "ps1.0:30.1": "Understanding of difference in attainment is knowledge of the meaning of attainment.",
  "ps1.0:31.1": "Understanding of difference in abiding and attainment is knowledge of the meaning of abiding and attainment.",
  "ps1.0:32.1": "Understanding of cutting off cankers due to pureness of non-distraction is knowledge of concentration with immediate (result).",
  "ps1.0:33.1": "Understanding as predominance of seeing, and as achievement of a peaceful abiding, and as resoluteness on the sublime goal, is knowledge of abiding without conflict.",
  "ps1.0:34.1": "Understanding as mastery owing to possession of two powers, to the tranquillizalion of three formations, to sixteen kinds of behaviour of knowledge, and to nine kinds of behaviour of concentration, is knowledge of the attainment of cessation.",
  "ps1.0:35.1": "Understanding of the termination of occurrence in one who is fully aware is knowledge of extinguishment.",
  "ps1.0:36.1": "Understanding of the complete cutting off of all ideas, of their cessation, and of their non-reappearance, is knowledge of the meaning of Same-headed-ness.",
  "ps1.0:37.1": "Understanding or separation, of difference and unity, and or termination of fires, is knowledge of effacement.",
  "ps1.0:38.1": "Understanding of the meaning of exertion in !hose possessed of self-bestirring and self-endeavour is knowledge of the application of energy.",
  "ps1.0:39.1": "Understanding of explaining different ideas is knowledge of demonstrating meanings.",
  "ps1.0:40.1": "Understanding of penetrating the includability of all ideas as one, and of their difference and unity, is knowledge of purity in seeing.",
  "ps1.0:41.1": "Understanding due to what is recognized is knowledge as choice.",
  "ps1.0:42.1": "Understanding due to what is touched is knowledge of fathoming.",
  "ps1.0:43.1": "Understanding of combination is knowledge of abiding in [ the reviewing of ideas as] parts",
  "ps1.0:44.1":"Understanding due to what is given predominance is knowledge of turning away through perception.",
  "ps1.0:45.1": "Understanding of difference is knowledge of turning away by the will.",
  "ps1.0:46.1": "NUnderstanding of establishing is knowledge of the turning away of cognizance.",
  "ps1.0:47.1": "Understanding of voidness is knowledge of the turning away of knowledge.",
  "ps1.0:48.1": "Understanding of relinquishment is knowledge.",
  "ps1.0:49.1": "Understanding of the meaning of suchness is knowledge of turning away in the actualities.",
  "ps1.0:50.1": "Understanding of the meaning of succeeding by defining body and cognizance as one and by steadying easy perception and quick perception is knowledge of the kinds of success (supernormal powers).",
  "ps1.0:51.1": "Understanding of fathoming sound signs in their difference and unity is knowledge of purification of the ear principle.",
  "ps1.0:52.1": "Understanding of fathoming behaviour of consciousness in its difference and unity by means of confidence (and non-confidence) in the (six) faculties due to ointervenction by three types of cognizances is knowledge of penetration of wills (hearts).",
  "ps1.0:53.1": "Understanding of fathoming ideas conditionally-arisen through intervention of difference and unity in action is knowledge of recollection of past life.",
  "ps1.0:54.1": "Understanding of seeing the meaning as signs of visible objects in their difference and unity by means of illumination is knowledge of the divine eye.",
  "ps1.0:55.1": "Understanding as mastery of three faculties in sixty-four aspects is knowledge of exhaustion of cankers.",
  "ps1.0:56.1": "Understanding of the meaning of full-understanding is knowledge of suffering.",
  "ps1.0:57.1": "Understanding of the meaning of abandoning is knowledge of origin.",
  "ps1.0:58.1": "Understanding of the meaning of realizing is knowledge of cessation.",
  "ps1.0:59.1": "Understanding of the meaning of developing is knowledge of the path.",
  "ps1.0:60.1": "Knowledge of suffering.",
  "ps1.0:61.1": "Knowledge of the origin of suffering.",
  "ps1.0:62.1": "Knowledge of the cessation of suffering.",
  "ps1.0:63.1": "Knowledge of the way leading to the cessation of suffering.",
  "ps1.0:64.1": "Knowledge of discrimination of meaning.",
  "ps1.0:65.1": "Knowledge of discrimination of ideas.",
  "ps1.0:66.1": "Knowledge of discrimination of language.",
  "ps1.0:67.1": "Knowledge of discrimination of perspicuity.",
  "ps1.0:68.1": "Knowledge of penetration of others' faculties .",
  "ps1.0:69.1": "Knowledge of beings' biases and underlying tendencies.",
  "ps1.0:70.1": "Knowledge of the Twin Metamorphosis.",
  "ps1.0:71.1": "Knowledge of the Great Compassion.",
  "ps1.0:72.1": "Omniscient Knowledge.",
  "ps1.0:73.1": "Unobstructed knowledge.",
  "ps1.0:74.1": "These are 73 kinds of  knowledge.",
  "ps1.0:74.2": "Of  these 73 kinds of knowledge, 67 are shared by disciples;",
  "ps1.0:74.3": "and 6 are not shared by disciples.",
  "ps1.0:74.4": "End of Schedule."
}